<a href="https://colab.research.google.com/github/Dkepffl/2022-1-ESAA/blob/main/Assignment/Assignment0318.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [2]:
import pandas as pd

## 04 데이터 핸들링-판다스
___
- 파이썬에서 데이터 처리를 위해 존재하는 라이브러리 중 가장 인기 있는 라이브러리
- 일반적으로 데이터셋은 2차원 데이터(행과 열로 구성되어 있다.)
- 넘파이 기반으로 작성된 라이브러리지만, 넘파이보다 훨씬 유연하고 편리한 데이터 핸들링 기능을 제공
- 파이썬의 리스트, 넘파이 등의 내부 데이터뿐만 아니라 CSV 등의 외부 파일을 쉽게 DataFrame으로 변경해준다.
- DataFrame을 정확하기 이해하기 위해서는 Index와 Series를 이해하는 것도 중요하다.

### | 판다스 시작
___
##### (1) **Pandas Module Import** : `as pd`로 에일리어스(alias)해 import하는 것이 관례
```python 
import pandas as pd
```
##### (2) 데이터 파일을 판다스의 DataFrame으로 로딩 : **Kaggle**에서 제공하는 타이타닉 탑승자 파일을 사용
  - Kaggle 데이터 다운로드하는 법
    1. Kaggle(www.kaggle.com) 에 로그인
    2. 책의 예제로 사용되는 캐글 데이터셋은 대부분 Kaggle Competition에 사용되는 예제이기 때문에, 'I Understand and Accept' 버튼을 클릭해야 다운받을 수 있다.
    3. 그 후, 'Download All' 버튼을 클릭하면 된다.
  - 타이타닉 탑승자 데이터 파일은 http://www.kaggle.com/c/titanic/data 에서 다운로드할 수 있다.
  - 판다스는 다양한 포맷으로 된 파일을 DataFrame으로 로딩할 수 있는 편리한 API를 제공한다.
    + `read_csv()` : CSV(','로 column을 구분한 파일 포맷) 파일 포맷 변환을 위한 API. sep 인자를 이용하여 아래처럼 구분 문자를 설정할 수 있다. 
    ```python
    read_csv('파일명 혹은 파일 경로',sep = '\t')
    ```
    + `read_table()` : '\t'로 column을 구분한 파일 포맷 변환을 위한 API
    + `read_fwf()` : 고정 길이 기반의 column 포맷을 변환하기 위한 API
  - 모든 DataFrame 내의 데이터는 생선되는 순간 고유한 Index 값을 가진다.

In [3]:
# 파일 경로를 이용해 로딩하기
titanic_df = pd.read_csv('/content/drive/MyDrive/2022-1 ESAA/DataSet/titanic/train.csv')
titanic_df.head(3) # 맨 앞의 3개의 row를 반환한다. default는 5개의 row

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [10]:
cd '/content/drive/MyDrive/2022-1 ESAA/DataSet/titanic'

/content/drive/MyDrive/2022-1 ESAA/DataSet/titanic

In [11]:
# 현재 Directory에 파일이 있다면 파일 이름으로 로딩 가능

titanic_df = pd.read_csv('train.csv')
print('titanic 변수 type : ', type(titanic_df))
titanic_df

titanic 변수 type :  <class 'pandas.core.frame.DataFrame'>

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [12]:
# DataFrame의 행과 열을 알아보는 방법 : DataFrame 객체의 shape 변수
print('DataFrame 크기 : ', titanic_df.shape) # (row, column) tuple 형태로 반환

DataFrame 크기 :  (891, 12)

##### (3) DataFrame의 정보를 `info()`와 `describe()` 메소드로 조회할 수 있다.
  - 데이터 값에 이상치가 많거나 분포가 적절하지 하지 않고 왜곡되어 있다면 머신러닝 알고리즘의 예측 성능이 저하되기 때문에 데이터의 분포도를 아는 것은 중요하다.
  - **info()** : 총 데이터 건수, 데이터 타입, Null 건수
  - **describe()** : column별 숫자형 데이터값의 n-percentile 분포도, 평균값,최댓값,최소값. 오직 숫자형 column의 분포도만 조사하며 자동으로 object 타입의 column은 출력에서 제외한다.
    + count : Not Null인 데이터 건수
    + mean : 전체 데이터의 평균값
    + std : 전체 데이터의 표준편차
    + min, max : 최솟값, 최댓값
    + n% : n percentile 값

In [13]:
# DataFRame의 정보 조회1 : info()
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [14]:
# DataFRame의 정보 조회2 : describe()
titanic_df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

- describe()는 해당 숫자 column이 숫자형 카테고리 column인지 판단할 수 있게 도와준다.
  + Category Column(범주형 데이터) : 특정 범주에 속하는 값을 코드한 값
  + 예를 들어 성별 column의 경우 '남'을 1, '여'를 2로 표현한 경우를 말한다.
- `titanic_df.describe()`에서 
    1. PassengerID column : 승객 ID를 식별 >> 분석을 위한 의미 있는 속성X
    2. Survived :  min이 0, 25~75%도 0, max가 1 >> 0과 1로 이루어진 숫자형 카테고리 Column으로 추정
    3. **Pclass** column의 값의 분포 : 
      * DataFrame의 []연산자 내부에 column명을 입력하면 Series 형태로 특정 column의 데이터셋이 반환된다.
      * 이렇게 반환된 Series 객체에 `value_counts()` 메서드를 호출하면 해당 Column의 유형과 건수를 확인할 수 있다.

In [15]:
# 데이터 분포도를 확인할 때 유용한 함수 : value_counts()
value_count = titanic_df['Pclass'].value_counts() # 지정된 Column의 데이터값 건수를 반환
print(value_count)

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [16]:
titani_pclass = titanic_df['Pclass']
print(type(titani_pclass )) # Series 객체 반환

<class 'pandas.core.series.Series'>

- Series : Index와 단 하나의 Column으로 구성된 데이터셋
  * 아래 Output에서 좌측값이 Series의 Index고, 우측값은 Series의 데이터 값이다.
  * 모든 Series와 DataFrame은 Index를 반드시 가진다.
  * `value_counts()` 메서드는 Series 객체에서만 정의되어 있다.
    + value_counts()가 반환하는 데이터 역시 Series 객체이다.
    + 역시 Index와 데이터 값으로 구성되어 있다.
    + 다만 Index가 0부터 시작하는 단순한 순차 값이 아니라 Pclass Coulmn의 값인 3, 1, 2를 나타내고 있다.
    + 이처럼 Index의 고유성이 보장된다면 식별자로 사용가능하다.
    + Index는 DataFrame, Series가 만들어진 후에도 숫자형이나 문자열로 변경 가능하다.

In [17]:
# Series 객체의 구성 확인
titani_pclass.head() # 앞에 있는 5개의 row 추출

0    3
1    1
2    3
3    1
4    3
Name: Pclass, dtype: int64

In [18]:
# value_counts() 메서드의 데이터 타입과 반환 값 확인
value_count = titanic_df['Pclass'].value_counts()
print(type(value_count))
print(value_count)

<class 'pandas.core.series.Series'>
3    491
1    216
2    184
Name: Pclass, dtype: int64

### | DataFrame과 리스트, 딕셔너리, 넘파이 ndarray 상호 변환
___
- DataFrame은 파이썬 리스트, 딕셔너리 그리고 넘파이의 ndarray 등 다양한 데이터로부터 생성될 수 있다.
- 또한 DataFrame은 반대로 파이썬 리스트, 딕셔너리 그리고 넘파이의 ndarray 등으로 변환될 수 있다.

##### (1) 넘파이 ndarray, 리스트, 딕셔너리를 DataFrame으로 변환하기

##### (2) DataFrame을 넘파이 ndarray, 리스트, 딕셔너리로 변환하기

### | DataFrame의 Column 데이터셋 생성과 수정
___
##### (1)

### | DataFrame 데이터 삭제
___
#####

### | Index 객체
___
#####

### | 데이터 셀렉션 및 필터링
___
##### (1) DataFrame의 [] 연산자

##### (2) DataFrame의 ix[] 연산자

##### (3) DataFrame의 [] 연산자

### | 정렬, Aggregation 함수, GroupBy 적용
___
##### (1) DataFrame, Series의 정렬 - sort_values()

##### (2) Aggregation 함수 적용

##### (3) groupby() 적용

### | 결손 데이터 처리하기
___
##### (1) isna()로 결손 데이터 여부 확인

##### (2) fillna()로 결손 데이터 대체하기

### | apply lambda 식으로 데이터 가공
___
##### (1) isna()로 결손 데이터 여부 확인

## 05 정리
___
-